export default `# 어썸보드와 어썸코드 익히기

## 학습 목표

<video controls width="100%">
    <source src="/video/Korean/starter/03.execute.webm" type="video/webm">
</video>

* 어썸보드와 어썸코드의 역할을 이해할 수 있다.
* 어썸보드의 주요 핀과 스위치를 알 수 있다.
* 블록코딩의 원리를 이해하고 기능 블록을 조립할 수 있다.
* LED를 켜고 끄는 방법을 이해할 수 있다.

## 먼저 알아보기

### 어썸보드 소개

어썸보드는 "파이썬(python)"이라는 프로그래밍 언어를 이용해서 다양한 장치를 동작시킬 수 있도록 만들어진 작은 컴퓨터입니다. 어썸보드에 달려 있는 여러 개의 핀에 다른 장치들을 연결하면, 각 핀에 연결된 장치에 프로그래밍 된 명령을 전달하여 원하는 동작을 하도록 만들 수 있습니다.

![](/images/etc/asomeboard_pinout.png)

[어썸보드 구조]

### 어썸코드 소개

현재 여러분들이 보고 있는 이 프로그램이 바로 어썸코드입니다. 이 프로그램은 학습하는 동안 필요한 각종 설명과 조립 과정, 블록코딩을 통한 프로그램 구조를 이해할 수 있도록 구성되어 있습니다. 그리고 전문 프로그래머들이 프로그램 코드를 입력하는 것처럼 프로그래밍 도구로도 쓸 수 있습니다.

![](/images/etc/AsomeCODE.png)

[어썸코드 실행 화면]

### 어썸보드와 어썸코드로 무엇을 만들 수 있을까요?

우리는 이번 교육에서 어썸보드와 어썸코드를 이용하여 다양한 장치를 만들고 이용해 볼 거예요. 간단한 게임기나 방범장치를 만들 수도 있고, 조금 더 배워서 중급이나 고급 과정을 배우게 되면, 춤추는 로봇이나 스마트폰으로 조종하는 RC 자동차도 만들 수 있어요.

<div style="text-align: center;">
    <img src="/images/etc/clock.png" style="width:30%;">
    <img src="/images/etc/asome_car.png" style="width:30%;">
    <img src="/images/etc/asome_bot.png" style="width:30%;">
</div>

이 외에도 어썸코드를 이용하면 여러분이 상상하는 다양한 것들을 만들 수 있어요. 네이버와 같은 포털사이트에 "아두이노 프로젝트"라고 입력해서 검색해보면 다양하고 재미있는 장치들을 만들어서 사용하고 있는 걸 알게 될 텐데요. 교육을 다 받고 여러분이 조금 더 노력한다면 누구나 원하는 장치들을 만들거나 발명을 할 수도 있을 거예요.
우선은 교육 내용을 한 단계씩 천천히 따라 하면서 배워보고, 그러면서 다른 사람들이 만든 발명품들도 자꾸 보면서 우리의 창의력을 함께 키워보는 건 어떨까요?

* 추천 사이트: [http://www.instructables.com/technology/arduino/](http://www.instructables.com/technology/arduino/)
`;
